app/views/static_pages/home.html.erb

SELECT "gossips".* FROM "gossips"
---
    <div class="row row-cols-4">
      <% Gossip.all.each do |gossip| %>