app/views/gossip/edit.html.erb

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 43], ["LIMIT", 1]]
---
<body>
  <% gossip = Gossip.find(params[:gossip_title])%>