app/views/gossip/show.html.erb

<body>
<% gossip = Gossip.find(params[:gossip_title])%>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  <h3>Commentaires : </h3>
  <% (gossip.comments).each do |com| %>
    <% comment = Comment.find(com.id) %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."gossip_id" = ?  [["gossip_id", 91]]
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]