app/views/user/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
<body>
<% author = User.find(params[:user_name])%>

SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = ?  [["user_id", 30]]
---
  <h4> Posts : </h4>
  <% author.gossips.each do |gossip| %>