app/views/login/profile.html.erb

<% user = User.find_by(id: session[:user_id])%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]

<h4>Listes de tes Gossips</h4>
<% user.gossips.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips" WHERE "gossips"."user_id" = ?  [["user_id", 35]]

    <h4>Listes de tes commentaires</h4>
<% user.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 35]]