app/controllers/gossips_controller.rb

INSERT INTO "gossips" ("user_id", "title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 23], ["title", "test"], ["content", "marche...."], ["created_at", "2023-05-10 08:32:10.030786"], ["updated_at", "2023-05-10 08:32:10.030786"]]
---
  def create
    puts "$" * 60
    puts "ceci est le contenu de params :"
    puts params
    author = User.find_by(id: session[:user_id])
    puts "$" * 60
    @gossip = Gossip.create(user: author,title:params["title"],content:params["content"] )