app/controllers/gossip_controller.rb

SELECT "users".* FROM "users" WHERE "users"."pseudo" = ? LIMIT ?  [["pseudo", "Augustine"], ["LIMIT", 1]]
SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "gossips"."id" = ?  [["title", "Ce post a été mis a jour"], ["content", "marche.... stp"], ["updated_at", "2023-05-10 12:57:10.747071"], ["id", 79]]
---
  def update
    author = User.find_by(pseudo: params["user"])
    @gossip = Gossip.find(params[:id])
    author_for_link = @gossip.user
    if @gossip.update(user: author,title:params["title"],content:params["content"] )

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = ? LIMIT ?  [["id", 44], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = ?  [["id", 44]]
---
  def delete
    @gossip = Gossip.find(params[:gossip_title])
    @gossip.destroy