app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Archeveque@houe.com"], ["LIMIT", 1]]
---
def create
  # cherche s'il existe un utilisateur en base avec l’e-mail
  user = User.find_by(email:params["email"])