app/controllers/sessions_controller.rb

SELECT "cities".* FROM "cities" WHERE "cities"."name" = ? LIMIT ?  [["name", "paris"], ["LIMIT", 1]]
INSERT INTO "users" ("city_id", "pseudo", "description", "email", "age", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    puts "$" * 60
    puts "ceci est le contenu de params :"
    puts params
    city = City.find_by(name: params["city"])
    puts city
    puts "$" * 60
    @user = User.create(pseudo: params["user_name"],email:params["email"],description:params["description"],age:params["age"],city:city,password: params["password"] )